{"data":{"markdownRemark":{"html":"<p>I really like the idea to embed a chart in the makedown with a very simple and readable syntax. And gatsby already have a plugin for it. <a href=\"https://www.gatsbyjs.org/packages/gatsby-remark-graph/\">gatsby-remark-graph</a></p>\n<p>This is a test chart with mermaid plugin.</p>\n<div class=\"mermaid\">graph LR\n    A[Start] -- Links To --> B((Circle))\n    A --> C(Round Rect)\n    B --> D{End}\n    C --> D</div>\n<div class=\"mermaid\">graph LR\n    A((Agile)) --> TDD[Test Driven Development]\n    A --> CI[Continuous Integration]\n    A --> CD[Continuous Delivery]</div>","frontmatter":{"date":"August 06, 2018","path":"/hello-mermaid","tags":["mermaid"],"title":"Hello Mermaid"}}},"pageContext":{"prev":{"excerpt":"Thoughts About Productivity Distrative Spot any steps in thw workflow that could easily distract from your work. For example, a developer might occarually run an end to end test. This e2e srcipts need few steps to complete.  install dependencies…","html":"<h1>Thoughts About Productivity</h1>\n<h2>Distrative</h2>\n<p>Spot any steps in thw workflow that could easily distract from your work. For example, a developer might occarually run an end to end test. This e2e srcipts need few steps to complete. </p>\n<ol>\n<li>install dependencies</li>\n<li>update webdriver</li>\n<li>start webdriver</li>\n<li>run the test scripts\nThe steps might look simple and easy to follow. But to an ordanary developer like myself, can only vaguely remember how to do this few weeks later. So what ends up is, I alwasy need to check the README or whatever that document the process. This is a distraction. A distraction will end up lots of mental cost, including context switching.\nA developer might developing a feature and just want to know wheather his code will pass the e2e tests, but now he has forced to switch context to learn how to run the tests again.\nIf these steps can be run in a single command, like <code class=\"language-text\">npm run e2e-test</code>, then it is a way better improvement in terms of distraction. A single command is way easy to remember than a sequnce of commands.</li>\n</ol>\n<p>Scripting all simple process if possible.</p>","id":"67c76856-a404-5e4e-9040-23878818d6fc","timeToRead":1,"frontmatter":{"date":"2018-08-08T22:38:22.164Z","path":"/thoughts-about-productivity","tags":["productivity"],"title":"Thoughts About Productivity"}},"next":{"excerpt":"Writing things down is always a good thing. Especially when you are solving a difficult problem. You need to analyze the problem, and digest your solution then come up with something. This is why I want to reboot this blog.","html":"<p>Writing things down is always a good thing. Especially when you are solving a difficult problem. You need to analyze the problem, and digest your solution then come up with something. This is why I want to reboot this blog.</p>","id":"211296dd-4ec8-597c-b518-31aea5ecdd3a","timeToRead":1,"frontmatter":{"date":"2018-08-06T09:17:16.525Z","path":"/reboot/","tags":["blog"],"title":"Blog Reboot"}}}}