{"data":{"allMarkdownRemark":{"edges":[{"node":{"excerpt":"Install Prism Plugin Prism is a lightweight, extensible syntax highlighter. Gatsby JS comes with a well integrated  plugin . Follow the instruction then you can render code snippets in a nice looking way.  Here is an example. The follwing markdown…","id":"3caaa5e3-3daa-5787-848f-fba679736a7f","frontmatter":{"title":"Install Prism Plugin","date":"August 23, 2018","path":"/install-prism-plugin"}}},{"node":{"excerpt":"Feature Toggle And Regression It is OK to violate DRY principls to copy the code when working on a new feature that is high couple to old behaviour. As a professional software engineer, I kind of strickly obey the DRY principals, and don't want to…","id":"a6ffd3ea-158f-5901-9195-a5e8e85f91cd","frontmatter":{"title":"Feature Toggle And Regression","date":"August 09, 2018","path":"/feature-toggle-and-regression"}}},{"node":{"excerpt":"Looking At The Root Problem Example, the translation fallback logic in the code. Using the webpack plugin only took me few hours. But the on going cost of adding and removing fallback logic is uncountable. Shell service gave us some crapy API, and we…","id":"8ce038d2-ed07-51a7-a98d-7ffcf5a693b1","frontmatter":{"title":"Looking At The Root Problem","date":"August 09, 2018","path":"/looking-at-the-root-problem"}}},{"node":{"excerpt":"Thoughts About Productivity Distrative Spot any steps in thw workflow that could easily distract from your work. For example, a developer might occarually run an end to end test. This e2e srcipts need few steps to complete.  install dependencies…","id":"67c76856-a404-5e4e-9040-23878818d6fc","frontmatter":{"title":"Thoughts About Productivity","date":"August 08, 2018","path":"/thoughts-about-productivity"}}},{"node":{"excerpt":"I really like the idea to embed a chart in the makedown with a very simple and readable syntax. And gatsby already have a plugin for it.  gatsby-remark-graph This is a test chart with mermaid plugin.","id":"31469f39-1b2a-5d71-9c41-b1a392592afc","frontmatter":{"title":"Hello Mermaid","date":"August 06, 2018","path":"/hello-mermaid"}}},{"node":{"excerpt":"Writing things down is always a good thing. Especially when you are solving a difficult problem. You need to analyze the problem, and digest your solution then come up with something. This is why I want to reboot this blog.","id":"211296dd-4ec8-597c-b518-31aea5ecdd3a","frontmatter":{"title":"Blog Reboot","date":"August 06, 2018","path":"/reboot/"}}},{"node":{"excerpt":"Manage your bookmark cross different browsers I was a heavy google chrome user, but since I a little bit scared about their privacy policy. I was seeking for alternative, turns of Opera is my first choose. The first problem I hit strait away is…","id":"fa2b8a2d-e225-50ae-9b84-38f2e78801a7","frontmatter":{"title":"Manage your bookmark cross different browsers","date":"May 22, 2017","path":"/start-me/"}}}]}},"pageContext":{}}