{"data":{"markdownRemark":{"html":"<h1>Thoughts About Productivity</h1>\n<h2>Distrative</h2>\n<p>Spot any steps in thw workflow that could easily distract from your work. For example, a developer might occarually run an end to end test. This e2e srcipts need few steps to complete. </p>\n<ol>\n<li>install dependencies</li>\n<li>update webdriver</li>\n<li>start webdriver</li>\n<li>run the test scripts\nThe steps might look simple and easy to follow. But to an ordanary developer like myself, can only vaguely remember how to do this few weeks later. So what ends up is, I alwasy need to check the README or whatever that document the process. This is a distraction. A distraction will end up lots of mental cost, including context switching.\nA developer might developing a feature and just want to know wheather his code will pass the e2e tests, but now he has forced to switch context to learn how to run the tests again.\nIf these steps can be run in a single command, like <code class=\"language-text\">npm run e2e-test</code>, then it is a way better improvement in terms of distraction. A single command is way easy to remember than a sequnce of commands.</li>\n</ol>\n<p>Scripting all simple process if possible.</p>","frontmatter":{"date":"August 08, 2018","path":"/thoughts-about-productivity","tags":["productivity"],"title":"Thoughts About Productivity"}}},"pageContext":{"prev":{"excerpt":"Looking At The Root Problem Sometime when we are working on a hard problem, we will kind of stuck in the middle and found lots of hacky way to overcome the problem. But lots of time, the solution is not perfect and you need to keep coming back cause…","html":"<h1>Looking At The Root Problem</h1>\n<p>Sometime when we are working on a hard problem, we will kind of stuck in the middle and found lots of hacky way to overcome the problem. But lots of time, the solution is not perfect and you need to keep coming back cause sometime it simply doesn't work. Sometimes, you need to look at the big picture, it might solve the problem entirely.</p>\n<p>Here is an example, the product I am working on has to support i18n. Means need to support multiple languages. The problem we have is we don't know when we will recieve the translations. If the translation doesn't come back by the time we ship our code, user will see some missing string when viewing in the languages other then English.</p>\n<p>To overcome this problem, we come up with an idea by adding fallback logic in our code base. If user is not viewing English, then we inject the missing translation in English. This works well, but it is time consuming. Adding the fallback logic is time consuming, removing the logic when translation came back is time consuming too.</p>\n<p>By looking at the problem again, we found we can simply using webpack plugin to merge the translation file, all the missing string in the translation files will be replace with English string. This only took me few hours to implement, but the on going cost of adding and removing fallback logic is uncountable.</p>","id":"8ce038d2-ed07-51a7-a98d-7ffcf5a693b1","timeToRead":1,"frontmatter":{"date":"2018-08-09T06:34:51.232Z","path":"/looking-at-the-root-problem","tags":["probelm solving"],"title":"Looking At The Root Problem"}},"next":{"excerpt":"I really like the idea to embed a chart in the makedown with a very simple and readable syntax. And gatsby already have a plugin for it.  gatsby-remark-graph This is a test chart with mermaid plugin.","html":"<p>I really like the idea to embed a chart in the makedown with a very simple and readable syntax. And gatsby already have a plugin for it. <a href=\"https://www.gatsbyjs.org/packages/gatsby-remark-graph/\">gatsby-remark-graph</a></p>\n<p>This is a test chart with mermaid plugin.</p>\n<div class=\"mermaid\">graph LR\n    A[Start] -- Links To --> B((Circle))\n    A --> C(Round Rect)\n    B --> D{End}\n    C --> D</div>\n<div class=\"mermaid\">graph LR\n    A((Agile)) --> TDD[Test Driven Development]\n    A --> CI[Continuous Integration]\n    A --> CD[Continuous Delivery]</div>","id":"31469f39-1b2a-5d71-9c41-b1a392592afc","timeToRead":1,"frontmatter":{"date":"2018-08-06T23:53:19.791Z","path":"/hello-mermaid","tags":["mermaid"],"title":"Hello Mermaid"}}}}